### I hope you have learned about pandas in a quite good manner , now its time to move on to a test for it. Here you are provided with some questions of which you need to write the code and test your understanding of the concept.

In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\nikhil sharma\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\nikhil sharma\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\nikhil sharma\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\nikhil sharma\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\nikhil sharma\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\nikhil sharma\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import pandas as pd
import numpy as np

### Q1.

```
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
```
**Write code to convert the above mydict variable into dataframe , your code should return a dataframe like below.**

```
a    0
b    1
c    2
d    4
```

In [11]:
import numpy as np
mylist = list('abcd')
myarr = np.arange(4)
mydict = dict(zip(mylist, myarr))

In [24]:
df = pd.DataFrame(list(mydict.items()), columns=['Letter' , 'Value'])

In [26]:
df.set_index('Letter', inplace=True)

In [28]:
print(df)

        Value
Letter
a           0
b           1
c           2
d           3

### Q2. Write the code to get frequency count of each character from the result of below command
```
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
```

In [3]:
## your output should look like this.

f    7
c    5
g    4
b    4
h    4
e    3
a    3
dtype: int64

In [30]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
frequency_count = ser.value_counts()

In [32]:
print(frequency_count)

g    9
e    5
a    5
h    4
d    2
b    2
f    2
c    1
Name: count, dtype: int64

### Q3. What parameter to do we need to add in read_csv, which let us read only a bunch of columns from the whole dataset.

In [34]:
# just write that parameter name here
import pandas as pd

In [142]:
df = pd.read_csv("fruits.csv")

In [144]:
print(df)

   Fruit Name  Quantity  Price
0      Banana        78    112
1       Mango        40    160
2      Banana        20     85
3   PineApple        15     90
4  Strawberry       100    200
5       Mango        25     60
6       Mango        40    100
7   PineApple        50    285

<p style="color:brown;">For Next 3 question you need to work on fruits sample dataset provided in resources.</p>

In [4]:
# read fruits.csv file

### Q4. Get mean, median, max , min price for each fruit .

In [9]:
# Your output should look like this

   Fruit Name        mean  median  max
0      Banana   98.500000    98.5  112
1       Mango  106.666667   100.0  160
2   PineApple  187.500000   187.5  285
3  Strawberry  200.000000   200.0  200

In [146]:
data = {
    'Fruit Name': ['Banana', 'Mango', 'Banana', 'PineApple', 'Strawberry', 'Mango', 'Mango', 'PineApple'],
    'Quantity': [78, 40, 20, 15, 100, 25, 40, 50],
    'Price': [112, 160, 85, 90, 200, 60, 100, 285]
}

In [148]:
f = pd.DataFrame(data)

In [152]:
result = df.groupby('Fruit Name')['Price'].agg(['mean', 'median', 'max', 'min']).reset_index()
print(result)

   Fruit Name        mean  median  max  min
0      Banana   98.500000    98.5  112   85
1       Mango  106.666667   100.0  160   60
2   PineApple  187.500000   187.5  285   90
3  Strawberry  200.000000   200.0  200  200

### Q5. What is the total cost of this basket?

In [66]:
#your output should be this

### Q6. Which fruit has the maximum price per quantity?

In [13]:
# your output should be

'PineApple'

In [154]:
data = {
    'Fruit Name': ['Banana', 'Mango', 'PineApple', 'Strawberry'],
    'Quantity': [78, 40, 15, 100],
    'Price': [112, 160, 90, 200]
}

df = pd.DataFrame(data)

In [156]:
df['Price per Quantity'] = df['Price'] / df['Quantity']
max_price_fruit = df.loc[df['Price per Quantity'].idxmax()]
print(max_price_fruit)

Fruit Name            PineApple
Quantity                     15
Price                        90
Price per Quantity          6.0
Name: 2, dtype: object

### Q7. Given an array 
```arr = [ 0,1,0,1,0,2,3,6,5,0,0,0,4,1,2,3,5,5,4,4 ]```
<br>
**Write code to  Create one_hot encoded dataframe of this array.**

In [18]:
#your output should be like this and should have 20 records in total

   0  1  2  3  4  5  6
0  1  0  0  0  0  0  0
1  0  1  0  0  0  0  0
2  1  0  0  0  0  0  0
3  0  1  0  0  0  0  0
4  1  0  0  0  0  0  0

### Q8. 
```
dict_ = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]

```
#### a. Convert this above dict to pandas dataframe

In [22]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [122]:
dict_ = {
    'First Score': [100, 90, np.nan, 95],
    'Second Score': [30, 45, 56, np.nan],
    'Third Score': [np.nan, 40, 80, 98]
}

In [124]:
df = pd.DataFrame(dict_)
print(df)

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

#### b. Write code to get the number of missing values for each column.

In [23]:
#your output should be like this

First Score     1
Second Score    1
Third Score     1
dtype: int64

In [126]:
dict_ = {
    'First Score': [100, 90, np.nan, 95],
    'Second Score': [30, 45, 56, np.nan],
    'Third Score': [np.nan, 40, 80, 98]
}

In [128]:
df = pd.DataFrame(dict_)
missing_values = df.isnull().sum()
print(missing_values)

First Score     1
Second Score    1
Third Score     1
dtype: int64

#### c. Fill this nan values with mean value of their respective column

In [27]:
#your output should be like this

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

In [130]:
ict_ = {
    'First Score': [100, 90, np.nan, 95],
    'Second Score': [30, 45, 56, np.nan],
    'Third Score': [np.nan, 40, 80, 98]
}

In [132]:
df = pd.DataFrame(dict_)
df_filled = df.fillna(df.mean())
print(df_filled)

   First Score  Second Score  Third Score
0        100.0     30.000000    72.666667
1         90.0     45.000000    40.000000
2         95.0     56.000000    80.000000
3         95.0     43.666667    98.000000

### Q9. Add an index column to the table used in Q4.
*HINT : Rest index*

In [28]:
#your output should be like this

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

In [134]:
data = {
    'Fruit Name': ['Banana', 'Mango', 'Banana', 'PineApple', 'Strawberry', 
                   'Mango', 'Mango', 'PineApple'],
    'Quantity': [78, 40, 20, 15, 100, 25, 40, 50],
    'Price': [112, 160, 85, 90, 200, 60, 100, 285]
}

In [136]:
df = pd.DataFrame(data)
df['price/quantity'] = df['Price'] / df['Quantity']
df.reset_index(drop=False, inplace=True)
df.rename(columns={'index': 'index'}, inplace=True)
print(df)

   index  Fruit Name  Quantity  Price  price/quantity
0      0      Banana        78    112        1.435897
1      1       Mango        40    160        4.000000
2      2      Banana        20     85        4.250000
3      3   PineApple        15     90        6.000000
4      4  Strawberry       100    200        2.000000
5      5       Mango        25     60        2.400000
6      6       Mango        40    100        2.500000
7      7   PineApple        50    285        5.700000

### Q10. 
**You are provided wih two different csv files ,**
```
sample_sheet_1.csv
sample_sheet_2.csv 
```
<p>
    
**You just need to read both of them , and merge them based on location column.**

In [30]:
#your output should be like this

  Location Population  ...  No. of shops Weekly market day
0      ABB   2.5 lakh  ...           150   Nothing as such
1      ABC   1.5 lakh  ...           120           Tuesday
2      CDD   3.5 lakh  ...           180         Wednesday

[3 rows x 6 columns]

In [158]:
df1 = pd.read_csv('sample_sheet_1.csv')
df2 = pd.read_csv('sample_sheet_2.csv')

In [160]:
merged_df = pd.merge(df1, df2, on='Location')

In [162]:
print(merged_df)

  Location Population  House_count Location Area  No. of shops  \
0      ABB   2.5 lakh          763    25 hectare           150
1      ABC   1.5 lakh          520    20 hectare           120
2      CDD   3.5 lakh          800    35 hectare           180

  Weekly market day
0   Nothing as such
1           Tuesday
2         Wednesday